# token : 말 덩어리 (음절 또는 형태소 형태로 잘려저 있는 놈)
# 임베딩 = 수치화

from tensorflow.keras.preprocessing.text import Tokenizer

text = '나는 지금 진짜 진짜 매우 매우 맛있는 김밥을 엄청 마구 마구 마구 마구 먹었다.'

token = Tokenizer() # 인스턴스(객체) = 클래스를 정의했다 = 인스턴스 생성
# 토크나이저를 인스턴스화 했어요 라고 표현함

token.fit_on_texts([text])

print(token.word_index)
# {'마구': 1, '진짜': 2, '매우': 3, '나는': 4, '지금': 5, '맛있는': 6, '김밥을': 7, '엄청': 8, '먹었다': 9}
# 빈도수가 높은 단어가 앞순위로 나왔다. 빈도수가 같음 앞에 있는게 우선순위로 수치화 됨

print(token.word_counts)
# OrderedDict([('나는', 1), ('지금', 1), ('진짜', 2), ('매우', 2), ('맛있는', 1), 
# ('김밥을', 1), ('엄청', 1), ('마구', 4), ('먹었다', 1)])

x = token.texts_to_sequences([text])
# 함수는 반환하다. 클래스는 인스턴스화 하다
print(x)
# [[4, 5, 2, 2, 3, 3, 6, 7, 8, 1, 1, 1, 1, 9]]  # (1,14) 행무시 열우선
# 수치화 (이건 임베딩이 아니다...)
# 지금은 수치화 한 상태로 숫자 그대로의 값으로 계산하기 때문에 위치값으로 바꿔줘야 한다
# 원핫인코딩 필요!!!
# print(x.shape) #AttributeError: 'list' object has no attribute 'shape'
print(len(x[0]))

# 원핫인코딩 3가지

# 1. 텐서플로우 (0부터 시작)
# to_categorical 함수를 사용하여 원핫인코딩 형태로 바꿔준다
# from tensorflow.keras.utils import to_categorical
# x = to_categorical(x)
# print(x)
# print(x.shape)
'''
[[[0. 0. 0. 0. 1. 0. 0. 0. 0. 0.]
  [0. 0. 0. 0. 0. 1. 0. 0. 0. 0.]
  [0. 0. 1. 0. 0. 0. 0. 0. 0. 0.]
  [0. 0. 1. 0. 0. 0. 0. 0. 0. 0.]
  [0. 0. 0. 1. 0. 0. 0. 0. 0. 0.]
  [0. 0. 0. 1. 0. 0. 0. 0. 0. 0.]
  [0. 0. 0. 0. 0. 0. 1. 0. 0. 0.]
  [0. 0. 0. 0. 0. 0. 0. 1. 0. 0.]
  [0. 0. 0. 0. 0. 0. 0. 0. 1. 0.]
  [0. 1. 0. 0. 0. 0. 0. 0. 0. 0.]
  [0. 1. 0. 0. 0. 0. 0. 0. 0. 0.]
  [0. 1. 0. 0. 0. 0. 0. 0. 0. 0.]
  [0. 1. 0. 0. 0. 0. 0. 0. 0. 0.]
  [0. 0. 0. 0. 0. 0. 0. 0. 0. 1.]]]
(1, 14, 10)
'''

# 2. 텐서플로우 (1부터 시작)
from tensorflow.keras.utils import to_categorical
import numpy as np
x = np.array(x)
x=x-1
x = to_categorical(x)
print(x)
print(x.shape)
'''
[[[0. 0. 0. 1. 0. 0. 0. 0. 0.]
  [0. 0. 0. 0. 1. 0. 0. 0. 0.]
  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
  [0. 1. 0. 0. 0. 0. 0. 0. 0.]
  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
  [0. 0. 1. 0. 0. 0. 0. 0. 0.]
  [0. 0. 0. 0. 0. 1. 0. 0. 0.]
  [0. 0. 0. 0. 0. 0. 1. 0. 0.]
  [0. 0. 0. 0. 0. 0. 0. 1. 0.]
  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
  [1. 0. 0. 0. 0. 0. 0. 0. 0.]
  [0. 0. 0. 0. 0. 0. 0. 0. 1.]]]
(1, 14, 9)
'''


#2. 판다스
# import pandas as pd
# x = pd.get_dummies(x[0], dtype=int) 
# print(x)
'''
    1  2  3  4  5  6  7  8  9
0   0  0  0  1  0  0  0  0  0
1   0  0  0  0  1  0  0  0  0
2   0  1  0  0  0  0  0  0  0
3   0  1  0  0  0  0  0  0  0
4   0  0  1  0  0  0  0  0  0
5   0  0  1  0  0  0  0  0  0
6   0  0  0  0  0  1  0  0  0
7   0  0  0  0  0  0  1  0  0
8   0  0  0  0  0  0  0  1  0
9   1  0  0  0  0  0  0  0  0
10  1  0  0  0  0  0  0  0  0
11  1  0  0  0  0  0  0  0  0
12  1  0  0  0  0  0  0  0  0
13  0  0  0  0  0  0  0  0  1
'''
 
# # 3. scikit learn → OneHotEncoder
# from sklearn.preprocessing import OneHotEncoder # 전처리
# import numpy as np

# ohe = OneHotEncoder(sparse_output=False)
# x = np.array(x)              #리스트를 넘파이로 변환
# x = x.reshape(-1,1)          #원핫인코딩을위한 reshape 실행
# print(x)
'''
[[4]
 [5]
 [2]
 [2]
 [3]
 [3]
 [6]
 [7]
 [8]
 [1]
 [1]
 [1]
 [1]
 [9]]
'''
# x = ohe.fit_transform(x)
# # x = ohe.fit_transform(x[0])
# print(x)
'''
[[0. 0. 0. 1. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 1. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 1. 0. 0. 0. 0. 0. 0.]
 [0. 0. 1. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 1. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 1. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 1. 0.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0.]
 [1. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 1.]]
'''

### x가 리스트일때 넘파이로 변환 np.array(x)


